<?xml version="1.0" ?>
<net name="blazeface" version="10">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,128,128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx_initializer_node_backbone1.0.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="24,3,5,5" size="7200"/>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_4/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="2,2" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_4/Dims1645/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="7200" shape="1,24,1,1" size="96"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_4" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Relu_5" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="62846287_const" type="Const" version="opset1">
			<data element_type="f32" offset="7296" shape="24,1,1,3,3" size="864"/>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_6/WithoutBiases" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_6/Dims1789/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="8160" shape="1,24,1,1" size="96"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_6" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="onnx_initializer_node_backbone1.2.convs.1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="8256" shape="24,24,1,1" size="2304"/>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_7/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_7/Dims1735/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="10560" shape="1,24,1,1" size="96"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_7" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Add_8" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Relu_9" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="62726275_const" type="Const" version="opset1">
			<data element_type="f32" offset="10656" shape="24,1,1,3,3" size="864"/>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_11/WithoutBiases" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_11/Dims1765/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="8160" shape="1,24,1,1" size="96"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_11" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="onnx_initializer_node_backbone1.3.convs.1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="11520" shape="28,24,1,1" size="2688"/>
			<output>
				<port id="1" precision="FP32">
					<dim>28</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_12/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>28</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_12/Dims1663/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="14208" shape="1,28,1,1" size="112"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_12" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>28</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>28</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Pad_10/Cast_16587_const" type="Const" version="opset1">
			<data element_type="i64" offset="14320" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Pad_10/Cast_26589_const" type="Const" version="opset1">
			<data element_type="i64" offset="14352" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="42414242_const" type="Const" version="opset1">
			<data element_type="f32" offset="14384" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="Pad_10" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3"/>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Add_13" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>28</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>28</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Relu_14" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>28</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="62806283_const" type="Const" version="opset1">
			<data element_type="f32" offset="14388" shape="28,1,1,3,3" size="1008"/>
			<output>
				<port id="1" precision="FP32">
					<dim>28</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_18/WithoutBiases" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="2,2" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>28</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>28</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_18/Dims1783/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="15396" shape="1,28,1,1" size="112"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_18" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>28</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>28</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="onnx_initializer_node_backbone1.4.convs.1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="15508" shape="32,28,1,1" size="3584"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>28</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_19/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>28</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>28</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_19/Dims1741/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="19092" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_19" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="MaxPool_16" type="MaxPool" version="opset1">
			<data kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>28</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Pad_17/Cast_16551_const" type="Const" version="opset1">
			<data element_type="i64" offset="14320" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Pad_17/Cast_26553_const" type="Const" version="opset1">
			<data element_type="i64" offset="14352" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="42054206_const" type="Const" version="opset1">
			<data element_type="f32" offset="14384" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="Pad_17" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>28</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3"/>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Add_20" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Relu_21" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="62566259_const" type="Const" version="opset1">
			<data element_type="f32" offset="19220" shape="32,1,1,3,3" size="1152"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_23/WithoutBiases" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_23/Dims1693/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="20372" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_23" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="onnx_initializer_node_backbone1.5.convs.1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="20500" shape="36,32,1,1" size="4608"/>
			<output>
				<port id="1" precision="FP32">
					<dim>36</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_24/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>36</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_24/Dims1669/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="25108" shape="1,36,1,1" size="144"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_24" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Pad_22/Cast_16599_const" type="Const" version="opset1">
			<data element_type="i64" offset="14320" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Pad_22/Cast_26601_const" type="Const" version="opset1">
			<data element_type="i64" offset="14352" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="42594260_const" type="Const" version="opset1">
			<data element_type="f32" offset="14384" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="Pad_22" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3"/>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Add_25" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Relu_26" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="62886291_const" type="Const" version="opset1">
			<data element_type="f32" offset="25252" shape="36,1,1,3,3" size="1296"/>
			<output>
				<port id="1" precision="FP32">
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_28/WithoutBiases" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_28/Dims1801/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="26548" shape="1,36,1,1" size="144"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_28" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="onnx_initializer_node_backbone1.6.convs.1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="26692" shape="42,36,1,1" size="6048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>42</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_29/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>42</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_29/Dims1825/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="32740" shape="1,42,1,1" size="168"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_29" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Pad_27/Cast_16561_const" type="Const" version="opset1">
			<data element_type="i64" offset="14320" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Pad_27/Cast_26563_const" type="Const" version="opset1">
			<data element_type="i64" offset="32908" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="42114212_const" type="Const" version="opset1">
			<data element_type="f32" offset="14384" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="Pad_27" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3"/>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Add_30" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Relu_31" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="62606263_const" type="Const" version="opset1">
			<data element_type="f32" offset="32940" shape="42,1,1,3,3" size="1512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>42</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_35/WithoutBiases" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="2,2" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>42</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_35/Dims1723/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="34452" shape="1,42,1,1" size="168"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_35" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="onnx_initializer_node_backbone1.7.convs.1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="34620" shape="48,42,1,1" size="8064"/>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>42</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_36/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>42</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_36/Dims1711/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="42684" shape="1,48,1,1" size="192"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_36" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="MaxPool_33" type="MaxPool" version="opset1">
			<data kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Pad_34/Cast_16595_const" type="Const" version="opset1">
			<data element_type="i64" offset="14320" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Pad_34/Cast_26597_const" type="Const" version="opset1">
			<data element_type="i64" offset="32908" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="42534254_const" type="Const" version="opset1">
			<data element_type="f32" offset="14384" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="85" name="Pad_34" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3"/>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Add_37" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Relu_38" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="62526255_const" type="Const" version="opset1">
			<data element_type="f32" offset="42876" shape="48,1,1,3,3" size="1728"/>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_40/WithoutBiases" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_40/Dims1687/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="44604" shape="1,48,1,1" size="192"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_40" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="onnx_initializer_node_backbone1.8.convs.1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="44796" shape="56,48,1,1" size="10752"/>
			<output>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv_41/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>56</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_41/Dims1795/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="55548" shape="1,56,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_41" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Pad_39/Cast_16569_const" type="Const" version="opset1">
			<data element_type="i64" offset="14320" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Pad_39/Cast_26571_const" type="Const" version="opset1">
			<data element_type="i64" offset="55772" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="42174218_const" type="Const" version="opset1">
			<data element_type="f32" offset="14384" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="99" name="Pad_39" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3"/>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Add_42" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Relu_43" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="62766279_const" type="Const" version="opset1">
			<data element_type="f32" offset="55804" shape="56,1,1,3,3" size="2016"/>
			<output>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_45/WithoutBiases" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_45/Dims1771/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="57820" shape="1,56,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_45" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="onnx_initializer_node_backbone1.9.convs.1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="58044" shape="64,56,1,1" size="14336"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_46/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_46/Dims1699/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="72380" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_46" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Pad_44/Cast_16573_const" type="Const" version="opset1">
			<data element_type="i64" offset="14320" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Pad_44/Cast_26575_const" type="Const" version="opset1">
			<data element_type="i64" offset="55772" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="42234224_const" type="Const" version="opset1">
			<data element_type="f32" offset="14384" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="113" name="Pad_44" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3"/>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Add_47" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Relu_48" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="63046307_const" type="Const" version="opset1">
			<data element_type="f32" offset="72636" shape="64,1,1,3,3" size="2304"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv_50/WithoutBiases" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Conv_50/Dims1855/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="74940" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Conv_50" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="onnx_initializer_node_backbone1.10.convs.1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="75196" shape="72,64,1,1" size="18432"/>
			<output>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Conv_51/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>72</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Conv_51/Dims1675/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="93628" shape="1,72,1,1" size="288"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Conv_51" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Pad_49/Cast_16577_const" type="Const" version="opset1">
			<data element_type="i64" offset="14320" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Pad_49/Cast_26579_const" type="Const" version="opset1">
			<data element_type="i64" offset="55772" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="42294230_const" type="Const" version="opset1">
			<data element_type="f32" offset="14384" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="127" name="Pad_49" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3"/>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Add_52" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Relu_53" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
